Repository: Rahul-pamula/tailoring
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: te

source: Telugu
te: తెలుగు

source: Tailoring Shop
te: టైలరింగ్ షాప్

source: Elegant Stitch
te: ఎలిగెంట్ స్టిచ్

source: Admin
te: అడ్మిన్

source: Logout
te: లాగౌట్

source: Admin Login
te: అడ్మిన్ లాగిన్

source: Our Designs
te: మా డిజైన్లు

source: No Image
te: చిత్రం లేదు

source: Price on Request
te: ధర అభ్యర్థనపై

source: No designs found.
te: డిజైన్లు కనుగొనబడలేదు.

source: Customer Reviews
te: కస్టమర్ రివ్యూలు

source: Submit a Review
te: రివ్యూను సమర్పించండి

source: Recent Reviews
te: ఇటీవలి రివ్యూలు

source: No reviews yet. Be the first!
te: ఇంకా రివ్యూలు లేవు. మీరే మొదటిగా రాయండి!

source: Review submitted for approval
te: ఆమోదం కోసం రివ్యూ సమర్పించబడింది
